# ─────────────────────────────────────────────────────────────────────────────#
#
# /A/I/ /D/E/T/E/C/T/I/O/N/
# video file editing
# - 2024/11/1
# - Hongsu Jung
# ─────────────────────────────────────────────────────────────────────────────#

# short-key
# function fold -> Ctrl + K, 0
# function unfold -> Ctrl + K, J
# remove breakpoint -> Ctrl + Shift + f9
# move next breakpoint -> Ctrl + Shift + D
# angle °

# icon, png download
# https://www.flaticon.com/search?word=golfer

# ─────────────────────────────────────────────────────────────────────────────#
# L/O/G/
#코드/블록 강조	 🔰	🔚 
#분석 범위 표시	 🔍 시작	 ✅ 끝
#디버깅용 로그	 🟢 Start	 🔴 End
#중요 구간 강조	 🚀 Begin	 🛑 End
#단계적 프로세스 ⏩ 시작	 ⏹ 종료
# 디버깅에서는 색상 기반 이모지 (🟢 🔴 🔵 🟡) 가 시각적으로 명확
# 실시간 출력에서는 화살표 (➡️ ⬅️ ⬇️ ⬆️) 도 유용
# time      : .
#🕒,⏱️, ⏲️, ⌛, ⏳ 조합도 활용 가능
# check     : ✅ 
# warning   : ⚠️❗
# check     : 🔥
# error     : ❌
# construction  : 🚧
# target    : 🎯🚩🎌
# idea      :💡🔦
# bug       : 🐛
# fast      : 🚀
# movie camera : 🎥
# frame     : 🎞
# 📽🎬📺📷📸📹🎦
# 📄📒📓🏁
# 0️⃣1️⃣2️⃣3️⃣4️⃣5️⃣6️⃣7️⃣8️⃣9️⃣🔟
# 🅰🆎🅱🔴🔵	
# zoom      : 🔍
# lock      : 🔒🔓🔑🔧
# block     : ⛔🚫🔞
# pin       : 📌
# heart     : ❤️
# victory   : ✌
# happy     : 😍
# mail      : 📪
# rest      : 🚬🚭
# sound 🔊
# 😉💀👿💩👽👾
# 👮💂👷👸👳🎅
# 🚶💃👯🏄🏊🛀💏🎨
# 🐵🐶🐺🐱🐯🐴🐎🐮🐷🐗🐘🐭🐹🐰🐔🐸🐍
# 🐳🐬🐟🐠
# 💝💓💋👀
# ✋👍👊👏💪
# 🎱🎮🎰🎲🎴		
# 👓🎓🔇🔈🎼🎚🎛🎤🎧📻	
# 🌏🗾🗺🌁♨
# 🕚☀⭐⛅🌀🌈⚡🔥🎀🎫
# ⚽⚾🏀🏈🎾🏉🏐🎾🥏🏏🏑🏒🥍🏓🏸🥊🥋🥅⛳⛸🤿🛷🥌		
# 📱📲☎	📞	📟	🔋🔌	💻💻⌨🖱	
# ─────────────────────────────────────────────────────────────────────────────#

